{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"special":true,"content":"<pad>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"<sos>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"<eos>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"<unk>","single_word":false,"lstrip":false,"rstrip":false,"normalized":false}],"normalizer":null,"pre_tokenizer":{"type":"Whitespace"},"post_processor":null,"decoder":null,"model":{"type":"WordPiece","unk_token":"<unk>","continuing_subword_prefix":"##","max_input_chars_per_word":100,"vocab":{"<pad>":0,"<sos>":1,"<eos>":2,"<unk>":3,"!":4,"'":5,",":6,".":7,"0":8,"1":9,"2":10,"3":11,"4":12,"5":13,"6":14,"7":15,"8":16,"9":17,"?":18,"A":19,"B":20,"C":21,"D":22,"E":23,"F":24,"G":25,"H":26,"I":27,"J":28,"K":29,"L":30,"M":31,"N":32,"O":33,"P":34,"Q":35,"R":36,"S":37,"T":38,"U":39,"V":40,"W":41,"X":42,"Y":43,"Z":44,"_":45,"a":46,"b":47,"c":48,"d":49,"e":50,"f":51,"g":52,"h":53,"i":54,"j":55,"k":56,"l":57,"m":58,"n":59,"o":60,"p":61,"q":62,"r":63,"s":64,"t":65,"u":66,"v":67,"w":68,"x":69,"y":70,"z":71,"À":72,"Á":73,"Â":74,"Ã":75,"È":76,"É":77,"Ê":78,"Ì":79,"Í":80,"Ò":81,"Ó":82,"Ô":83,"Õ":84,"Ù":85,"Ú":86,"Ý":87,"à":88,"á":89,"â":90,"ã":91,"è":92,"é":93,"ê":94,"ì":95,"í":96,"ò":97,"ó":98,"ô":99,"õ":100,"ù":101,"ú":102,"ý":103,"Ă":104,"ă":105,"Đ":106,"đ":107,"Ĩ":108,"ĩ":109,"Ũ":110,"ũ":111,"Ơ":112,"ơ":113,"Ư":114,"ư":115,"Ạ":116,"ạ":117,"Ả":118,"ả":119,"Ấ":120,"ấ":121,"Ầ":122,"ầ":123,"Ẩ":124,"ẩ":125,"Ẫ":126,"ẫ":127,"Ậ":128,"ậ":129,"Ắ":130,"ắ":131,"Ằ":132,"ằ":133,"Ẳ":134,"ẳ":135,"Ẵ":136,"ẵ":137,"Ặ":138,"ặ":139,"Ẹ":140,"ẹ":141,"Ẻ":142,"ẻ":143,"Ẽ":144,"ẽ":145,"Ế":146,"ế":147,"Ề":148,"ề":149,"Ể":150,"ể":151,"Ễ":152,"ễ":153,"Ệ":154,"ệ":155,"Ỉ":156,"ỉ":157,"Ị":158,"ị":159,"Ọ":160,"ọ":161,"Ỏ":162,"ỏ":163,"Ố":164,"ố":165,"Ồ":166,"ồ":167,"Ổ":168,"ổ":169,"Ỗ":170,"ỗ":171,"Ộ":172,"ộ":173,"Ớ":174,"ớ":175,"Ờ":176,"ờ":177,"Ở":178,"ở":179,"Ỡ":180,"ỡ":181,"Ợ":182,"ợ":183,"Ụ":184,"ụ":185,"Ủ":186,"ủ":187,"Ứ":188,"ứ":189,"Ừ":190,"ừ":191,"Ử":192,"ử":193,"Ữ":194,"ữ":195,"Ự":196,"ự":197,"Ỳ":198,"ỳ":199,"Ỵ":200,"ỵ":201,"Ỷ":202,"ỷ":203,"Ỹ":204,"ỹ":205,"##r":206,"##ú":207,"##c":208,"##b":209,"##a":210,"##d":211,"##l":212,"##o":213,"##k":214,"##s":215,"##y":216,"##i":217,"##h":218,"##n":219,"##p":220,"##m":221,"##t":222,"##e":223,"##0":224,"##8":225,"##I":226,"##C":227,"##T":228,"##U":229,"##R":230,"##E":231,"##g":232,"##v":233,"##z":234,"##j":235,"##w":236,"##1":237,"##ạ":238,"##đ":239,"##ộ":240,"##ờ":241,"##4":242,"##B":243,"##2":244,"##7":245,"##u":246,"##x":247,"##f":248,"##q":249,"##F":250,"##A":251,"##N":252,"##S":253,"##G":254,"##M":255,"##D":256,"##K":257,"##P":258,"##Y":259,"##O":260,"##L":261,"##6":262,"##H":263,"##Z":264,"##V":265,"##ẻ":266,"##3":267,"##í":268,"##ủ":269,"##ô":270,"##Ứ":271,"##ố":272,"##è":273,"##é":274,"##ầ":275,"##ó":276,"##9":277,"##â":278,"##5":279,"##Ê":280,"##ả":281,"##ò":282,"##Ố":283,"##á":284,"##Ẻ":285,"##ụ":286,"##Ể":287,"##W":288,"##ư":289,"##X":290,"##ứ":291,"##ề":292,"##ơ":293,"##ã":294,"##ậ":295,"##ể":296,"##J":297,"##ị":298,"##ẹ":299,"##ắ":300,"##ỗ":301,"##Q":302,"##ê":303,"##Ì":304,"##ấ":305,"##ẳ":306,"##ỏ":307,"##Á":308,"##ừ":309,"##ệ":310,"##ớ":311,"##Đ":312,"##ă":313,"##à":314,"##Ó":315,"##ế":316,"##ọ":317,"##Ế":318,"##ợ":319,"##ù":320,"##ẫ":321,"##ẽ":322,"##ẩ":323,"##Ư":324,"##Ợ":325,"##ì":326,"##ĩ":327,"##ũ":328,"##À":329,"##ữ":330,"##Ắ":331,"##ổ":332,"##Ỏ":333,"##ỉ":334,"##Ạ":335,"##Ổ":336,"##ử":337,"##ự":338,"##Ã":339,"##ỵ":340,"##Ơ":341,"##Ặ":342,"##Ờ":343,"##Ử":344,"##Ũ":345,"##Ô":346,"##ồ":347,"##Ẩ":348,"##Ộ":349,"##ở":350,"##õ":351,"##ặ":352,"##ằ":353,"##ỳ":354,"##ý":355,"##Ấ":356,"##Ề":357,"##Í":358,"##Ụ":359,"##Ầ":360,"##ễ":361,"##Ỳ":362,"##Â":363,"##Ọ":364,"##Ỷ":365,"##Ậ":366,"##Ò":367,"##Ẫ":368,"##Ỗ":369,"##ẵ":370,"##ỡ":371,"##Ệ":372,"##Ớ":373,"##É":374,"##.":375,"##Ả":376,"##Ị":377,"##Ủ":378,"##Ă":379,"##Ẽ":380,"##Ồ":381,"##Ù":382,"##ỹ":383,"##Ở":384,"##Õ":385,"##Ự":386,"##Ừ":387,"##Ẳ":388,"##Ễ":389,"##È":390,"##Ú":391,"##Ĩ":392,"##?":393,"##ỷ":394,"##Ý":395,"##Ỉ":396,"##Ẵ":397,"##Ỡ":398,"##Ữ":399,"##Ỹ":400,"##Ằ":401,"##Ẹ":402,"##!":403,"##Ỵ":404,"##,":405,"##'":406,"##ng":407,"th":408,"##er":409,"ch":410,"the":411,"##on":412,"##nh":413,"##at":414,"##an":415,"##ou":416,"tr":417,"##en":418,"##es":419,"##or":420,"##ed":421,"nh":422,"to":423,"kh":424,"##nd":425,"##ing":426,"of":427,"##ar":428,"ng":429,"##al":430,"##is":431,"##in":432,"##it":433,"##ôi":434,"ph":435,"##ông":436,"##om":437,"in":438,"##ic":439,"là":440,"##ion":441,"##as":442,"##le":443,"and":444,"##ch":445,"Th":446,"gi":447,"và":448,"##iệ":449,"##re":450,"tôi":451,"qu":452,"##ay":453,"##ên":454,"có":455,"##ủa":456,"you":457,"của":458,"##ll":459,"##et":460,"##ent":461,"##ột":462,"##ác":463,"không":464,"##ời":465,"##iế":466,"##ow":467,"##iề":468,"một":469,"##ve":470,"##st":471,"##ượ":472,"##ct":473,"re":474,"##ot":475,"##ới":476,"is":477,"##ong":478,"##ất":479,"##id":480,"##ut":481,"##iều":482,"be":483,"##ại":484,"##am":485,"for":486,"##ày":487,"##uy":488,"##ạn":489,"##ation":490,"##ly":491,"##ược":492,"on":493,"ta":494,"##ro":495,"##se":496,"ha":497,"đã":498,"##úng":499,"được":500,"##ur":501,"nó":502,"##im":503,"##ig":504,"The":505,"##ười":506,"that":507,"wh":508,"##ld":509,"sa":510,"ngh":511,"##ere":512,"##ce":513,"it":514,"con":515,"##ình":516,"cho":517,"Ch":518,"bạn":519,"do":520,"trong":521,"các":522,"người":523,"st":524,"với":525,"##ir":526,"đó":527,"##ải":528,"##ây":529,"##ver":530,"##ang":531,"##ad":532,"##ter":533,"was":534,"chúng":535,"này":536,"##ân":537,"##ith":538,"sh":539,"##il":540,"thể":541,"##ản":542,"##ment":543,"##ành":544,"##ol":545,"##th":546,"he":547,"##ững":548,"##iên":549,"sẽ":550,"an":551,"##iể":552,"như":553,"##ần":554,"##ăm":555,"we":556,"as":557,"##iện":558,"ho":559,"##ầu":560,"with":561,"##ke":562,"me":563,"cá":564,"ra":565,"##uố":566,"##au":567,"làm":568,"##ướ":569,"##ật":570,"##od":571,"##ến":572,"##ực":573,"20":574,"những":575,"##ết":576,"anh":577,"Tom":578,"##est":579,"##ấy":580,"this":581,"##iết":582,"họ":583,"##pp":584,"##ht":585,"##ài":586,"##ul":587,"lo":588,"đị":589,"pro":590,"se":591,"##and":592,"năm":593,"về":594,"##ag":595,"##ill":596,"##ers":597,"##em":598,"nói":599,"##ant":600,"##ức":601,"đến":602,"##ao":603,"##tic":604,"##ươ":605,"are":606,"##ước":607,"com":608,"để":609,"li":610,"##ess":611,"Điều":612,"Ar":613,"go":614,"Tôi":615,"##ằng":616,"##op":617,"##ườ":618,"have":619,"độ":620,"quy":621,"##us":622,"##ri":623,"phải":624,"##ust":625,"##ường":626,"##ate":627,"##ận":628,"de":629,"or":630,"vào":631,"từ":632,"at":633,"##ck":634,"định":635,"not":636,"##ain":637,"số":638,"##inh":639,"cả":640,"##ối":641,"su":642,"gì":643,"##all":644,"Tr":645,"##anh":646,"khi":647,"And":648,"##ight":649,"##áng":650,"##ính":651,"##ist":652,"##ập":653,"##ies":654,"sự":655,"##el":656,"Nh":657,"##ticle":658,"##ect":659,"ne":660,"công":661,"##ould":662,"##àn":663,"Article":664,"##rom":665,"phá":666,"điều":667,"##ương":668,"##ơn":669,"ex":670,"##àng":671,"lại":672,"##ra":673,"##ào":674,"##iệc":675,"##ab":676,"##ung":677,"ấy":678,"##if":679,"đi":680,"can":681,"##um":682,"đầu":683,"thu":684,"19":685,"##ort":686,"##ai":687,"##ity":688,"##os":689,"ab":690,"It":691,"##00":692,"##ùng":693,"by":694,"##ok":695,"Wh":696,"##ục":697,"bị":698,"##out":699,"so":700,"wor":701,"my":702,"việc":703,"biết":704,"##ia":705,"You":706,"##un":707,"##ore":708,"from":709,"tom":710,"mà":711,"đây":712,"We":713,"Ng":714,"cô":715,"##ary":716,"##âu":717,"##art":718,"##ard":719,"kn":720,"đang":721,"tại":722,"He":723,"chuy":724,"chỉ":725,"thế":726,"ngày":727,"al":728,"Kh":729,"##uốn":730,"##ome":731,"thành":732,"nghĩ":733,"##ally":734,"theo":735,"##iến":736,"##ear":737,"##iểm":738,"all":739,"##êu":740,"##ăng":741,"sau":742,"##ậy":743,"nhà":744,"##ap":745,"pl":746,"Và":747,"your":748,"##ổi":749,"his":750,"động":751,"thực":752,"##nt":753,"##her":754,"##ồi":755,"sp":756,"##ếu":757,"##ội":758,"In":759,"know":760,"thấy":761,"muốn":762,"##ắt":763,"##end":764,"##iệu":765,"trên":766,"##ống":767,"hiện":768,"quan":769,"##ie":770,"dụ":771,"##ame":772,"##one":773,"pr":774,"##ồng":775,"rằng":776,"##ách":777,"##ci":778,"##án":779,"what":780,"##ảo":781,"mình":782,"Ph":783,"out":784,"##ộc":785,"##ơi":786,"le":787,"201":788,"khác":789,"ông":790,"##ền":791,"kho":792,"##ũng":793,"##ud":794,"about":795,"##ọi":796,"they":797,"##ive":798,"##ái":799,"up":800,"So":801,"##qu":802,"giá":803,"##iz":804,"##our":805,"##ấp":806,"##ưa":807,"hành":808,"hơn":809,"tháng":810,"##iv":811,"đề":812,"tiế":813,"nào":814,"te":815,"##ine":816,"rất":817,"one":818,"##ữa":819,"like":820,"em":821,"##ích":822,"##ak":823,"##age":824,"##ry":825,"dụng":826,"##òng":827,"##ime":828,"##ợp":829,"##ice":830,"us":831,"##ạt":832,"##ặc":833,"cũng":834,"##ations":835,"nhiều":836,"##oug":837,"học":838,"##ast":839,"nước":840,"##ep":841,"chính":842,"man":843,"##ack":844,"lý":845,"##ink":846,"##ure":847,"ag":848,"##ans":849,"##ber":850,"##ỏi":851,"##ind":852,"##ions":853,"tư":854,"dự":855,"hợp":856,"##ắc":857,"##ôn":858,"comp":859,"lu":860,"##ặt":861,"giờ":862,"##cc":863,"there":864,"##úc":865,"##òn":866,"##ound":867,"but":868,"##át":869,"##per":870,"##ance":871,"Gi":872,"cái":873,"fo":874,"Sh":875,"hàng":876,"##iệm":877,"nhận":878,"tin":879,"her":880,"want":881,"##ện":882,"##ost":883,"##ip":884,"##ach":885,"en":886,"don":887,"im":888,"##ish":889,"thứ":890,"ar":891,"##ạo":892,"##NG":893,"get":894,"sử":895,"##ượng":896,"just":897,"##ause":898,"St":899,"vụ":900,"##ăn":901,"##ide":902,"##uct":903,"were":904,"sao":905,"##ec":906,"him":907,"has":908,"nhất":909,"##ịch":910,"đồng":911,"nhân":912,"vì":913,"had":914,"##ated":915,"cơ":916,"cách":917,"##ứng":918,"di":919,"will":920,"##ff":921,"thì":922,"gia":923,"##ib":924,"##ther":925,"said":926,"##orm":927,"cont":928,"did":929,"##ưng":930,"nhưng":931,"##ous":932,"200":933,"##lo":934,"##ich":935,"10":936,"##ốc":937,"if":938,"##ord":939,"vậy":940,"##port":941,"##ắn":942,"##ẫn":943,"##ởng":944,"Chúng":945,"##ấn":946,"int":947,"time":948,"##eop":949,"work":950,"any":951,"This":952,"res":953,"who":954,"##ậu":955,"mu":956,"##iệt":957,"##ánh":958,"##iền":959,"##uộc":960,"Anh":961,"##eople":962,"think":963,"here":964,"xu":965,"##iểu":966,"cần":967,"##iển":968,"##ac":969,"nên":970,"thời":971,"bằng":972,"ve":973,"bảo":974,"##ấu":975,"##ven":976,"còn":977,"bản":978,"co":979,"trình":980,"bao":981,"trước":982,"thông":983,"cùng":984,"##ốt":985,"##itt":986,"lên":987,"app":988,"##ign":989,"chức":990,"##ue":991,"##og":992,"vi":993,"trường":994,"##iệp":995,"year":996,"000":997,"shall":998,"sản":999}}}